#pragma once

// Дана последовательность натуральных чисел (одно число в строке), завершающаяся числом 0.
// Выведите все нечетные числа из этой последовательности, сохраняя их порядок. 
// В этой задаче нельзя использовать глобальные переменные и передавать какие -
// либо параметры в рекурсивную функцию.Функция получает данные, считывая их с клавиатуры.
// Функция не возвращает значение, а сразу же выводит результат на экран.
// Основная программа должна состоять только из вызова этой функции.
int uneven(int number);

// Дана последовательность натуральных чисел (одно число в строке), завершающаяся числом 0.
// Определите наибольшее значение числа в этой последовательности.
int Max(int number);