#pragma once

// ƒана последовательность натуральных чисел (одно число в строке), завершающа€с€ числом 0.
// ¬ыведите все нечетные числа из этой последовательности, сохран€€ их пор€док. 
// ¬ этой задаче нельз€ использовать глобальные переменные и передавать какие -
// либо параметры в рекурсивную функцию.‘ункци€ получает данные, считыва€ их с клавиатуры.
// ‘ункци€ не возвращает значение, а сразу же выводит результат на экран.
// ќсновна€ программа должна состо€ть только из вызова этой функции.
void uneven();

// ƒана последовательность натуральных чисел (одно число в строке), завершающа€с€ числом 0.
// ќпределите наибольшее значение числа в этой последовательности.
int max(int number);

// ƒана последовательность натуральных чисел (одно число в строке), завершающа€с€ числом 0 подр€д.
// ќпределите, сколько раз в этой последовательности встречаетс€ число 1. „исла, идущие после двух нулей,
// необходимо игнорировать.
int count1();